<a href="https://colab.research.google.com/github/NBK-code/Leetcode_Problems/blob/main/SQL_Leetcode.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

595. Big Countries

In [ ]:
SELECT name, population, area
FROM World
WHERE area > 3000000 OR population > 25000000

175. Combine two tables

In [ ]:
SELECT p.firstName, p.lastName, a.city, a.state
FROM Person p
LEFT JOIN Address a
ON p.personId = a.personID

181. Employees Earning More Than Their Managers

In [ ]:
SELECT a.name AS Employee
FROM Employee a 
JOIN Employee b
ON a.managerId = b.id
WHERE a.salary > b.salary

182. Duplicate Emails

In [ ]:
SELECT DISTINCT a.email AS Email
FROM Person a
JOIN Person b
ON a.email = b.email AND a.id <> b.id

183. Customers Who Never Order

In [ ]:
SELECT a.name AS Customers
FROM Customers a
LEFT JOIN Orders b
ON a.id = b.customerId
WHERE b.id IS NULL

196. Delete Duplicate Emails

In [ ]:
DELETE b
FROM Person a
JOIN Person b
ON a.email = b.email
AND a.Id < b.Id

197. Rising Temperature

In [ ]:
SELECT a.id
FROM Weather a
JOIN Weather b
ON DATEDIFF(a.recordDate, b.recordDate) = 1
WHERE a.temperature > b.temperature

176. Second Highest Salary

In [ ]:
SELECT MAX(Salary) AS SecondHighestSalary
FROM Employee
WHERE Salary < (SELECT Max(Salary)
                FROM Employee)

177. Nth Highest Salary

In [ ]:
CREATE FUNCTION getNthHighestSalary(N INT) RETURNS INT
BEGIN

SET N = N-1;
  RETURN (
      # Write your MySQL query statement below.
      
      IFNULL(
      (SELECT DISTINCT Salary
       FROM Employee
       ORDER BY Salary DESC
       LIMIT 1 OFFSET N), NULL
      )
  );
END

178. Rank Scores

In [ ]:
SELECT Score, 
DENSE_RANK() OVER(ORDER BY Score DESC) AS "Rank" 
FROM scores

180. Consecutive Numbers

In [ ]:
SELECT DISTINCT a.num AS ConsecutiveNums
FROM Logs a
JOIN Logs b
ON a.id = b.id + 1 AND a.num = b.num
JOIN Logs c
ON a.id = c.id + 2 AND a.num = c.num

184. Department Highest Salary

In [ ]:
SELECT c.name AS "Department", a.name AS "Employee", a.salary AS "Salary"
FROM Employee a
JOIN (SELECT departmentId, MAX(salary) AS "max"
      FROM Employee
      GROUP BY departmentId) b
ON a.departmentId = b.departmentId
JOIN Department c
ON a.departmentId = c.id
WHERE a.salary = b.max

512. Game Play Analysis II

In [ ]:
SELECT a.player_id, a.device_id
FROM Activity a
JOIN (SELECT player_id, MIN(event_date) AS "first_login"
      FROM Activity
      GROUP BY player_id) b
ON a.player_id = b.player_id
WHERE a.event_date = b.first_login

534. Game Play Analysis III

In [ ]:
SELECT player_id, event_date,
SUM(games_played) OVER(PARTITION BY player_id ORDER BY event_date ASC) AS "games_played_so_far"
FROM Activity

550. Game Play Analysis IV

In [ ]:
SELECT ROUND(COUNT(b.player_id)/COUNT(a.player_id),2) AS "fraction"
FROM (SELECT player_id, MIN(event_date) AS "event_date"
      FROM Activity
      GROUP BY player_id) a
LEFT JOIN Activity b
ON a.player_id = b.player_id AND a.event_date + 1 = b.event_date

577. Employee Bonus

In [ ]:
SELECT a.name, b.bonus
FROM Employee a
LEFT JOIN Bonus b
ON a.empId = b.empId
WHERE b.bonus < 1000 OR b.bonus IS NULL

603. Consecutive Available Seats

In [ ]:
SELECT DISTINCT a.seat_id
FROM Cinema a
JOIN Cinema b
ON ABS(a.seat_id - b.seat_id) = 1
WHERE a.free = 1 AND b.free = 1
ORDER BY a.seat_id ASC

607. Sales Person

In [ ]:
SELECT name
FROM Salesperson
WHERE sales_id NOT IN (SELECT sales_id
                       FROM Orders
                       WHERE com_id = (SELECT com_id
                                       FROM Company
                                       WHERE name = "RED"))

610. Triangle Judgement

In [ ]:
SELECT x, y, z,
CASE WHEN x+y<=z OR
          x+z<=y OR
          y+z<=x
     THEN 'No'
     ELSE 'Yes'
END AS 'triangle'
FROM triangle;

570. Managers with at Least 5 Direct Reports

In [ ]:
SELECT a.name
FROM Employee a
JOIN
(SELECT managerId, COUNT(managerId)
FROM Employee 
GROUP BY managerId
HAVING managerId IS NOT NULL AND COUNT(managerId) > 4) b
ON a.id = b.managerId

612. Shortest Distance in a Plane

In [ ]:
select ROUND(SQRT(min((p1.x-p2.x)*(p1.x-p2.x)+(p1.y-p2.y)*(p1.y-p2.y))),2) as shortest
from point2d p1, point2d p2
where p1.x <> p2.x or p1.y <> p2.y

In [ ]:
with t as    
    (select *, row_number() over() row_n
    from point_2d)

select round(sqrt(min(power((a.x-b.x),2) + power((a.y-b.y),2))), 2) shortest
from t a
join t b on a.row_n>b.row_n

626. Exchange Seats

In [ ]:
select if(id = (select max(id) from seat) and id%2 = 1, id, if(id % 2 = 0, id-1, id+1)) as id, student
from seat
order by id asc

1045. Customers Who Bought All Products

In [ ]:
Select customer_id
from customer
group by customer_id
having count(distinct(product_key)) = (select count(product_key) from product)

1126. Active Businesses

In [ ]:
select a.business_id
from events a
join (select distinct event_type, avg(occurences) over(partition by event_type) as "avg"
from events) b
on a.event_type = b.event_type
group by a.business_id
having sum(a.occurences > b.avg) > 1

627. Swap Salary

In [ ]:
UPDATE salary SET sex = IF(sex = 'm', 'f', 'm')

613. Shortest Distance in a Line

In [ ]:
select min(abs(p1.x - p2.x)) as shortest
from point p1, point p2
where p1.x <> p2.x

1084. Sales Analysis III

In [ ]:
SELECT product_id, product_name 
FROM Product 
WHERE product_id IN
(SELECT product_id
FROM Sales
GROUP BY product_id
HAVING MIN(sale_date) >= '2019-01-01' AND MAX(sale_date) <= '2019-03-31')

1113. Reported Posts

In [ ]:
select a.extra as "report_reason", count(a.extra) as "report_count"
from
(select distinct extra, post_id
from actions
where action_date = '2019-07-04' and extra is not null and action = "report") as a
group by a.extra

597. Friend Requests I: Overall Acceptance Rate

In [ ]:
select ifnull(round(count(distinct requester_id, accepter_id)/count(distinct sender_id, send_to_id),2),0.00) as "accept_rate"
from requestaccepted, friendrequest

1098. Unpopular Books

In [ ]:
select a.book_id, a.name
from
(select book_id, name
from books
where available_from < "2019-05-23") a
left join 
(select book_id, sum(quantity) as qty
from orders
where dispatch_date > "2018-06-23"
group by book_id) b
on a.book_id = b.book_id
where ifnull(b.qty,0) < 10

608. Tree Node

In [ ]:
select id, 
case 
when p_id is null then "Root" 
when id not in (select p_id from tree where p_id is not null) then "Leaf"
else "Inner" 
end as "type"
from tree

1179. Reformat Department Table

In [ ]:
select id,
sum(case when month = "Jan" then revenue else null end) as "Jan_Revenue",
sum(case when month = "Feb" then revenue else null end) as "Feb_Revenue",
sum(case when month = "Mar" then revenue else null end) as "Mar_Revenue",
sum(case when month = "Apr" then revenue else null end) as "Apr_Revenue",
sum(case when month = "May" then revenue else null end) as "May_Revenue",
sum(case when month = "Jun" then revenue else null end) as "Jun_Revenue",
sum(case when month = "Jul" then revenue else null end) as "Jul_Revenue",
sum(case when month = "Aug" then revenue else null end) as "Aug_Revenue",
sum(case when month = "Sep" then revenue else null end) as "Sep_Revenue",
sum(case when month = "Oct" then revenue else null end) as "Oct_Revenue",
sum(case when month = "Nov" then revenue else null end) as "Nov_Revenue",
sum(case when month = "Dec" then revenue else null end) as "Dec_Revenue"
from department
group by id

1193. Monthly Transactions I

In [ ]:
select date_format(trans_date, '%Y-%m') as "month", country, count(state) as trans_count, sum(case when state = "approved" then 1 else 0 end) as approved_count, sum(amount) as trans_total_amount, sum(case when state = "approved" then amount else 0 end) as approved_total_amount
from transactions
group by month, country

#Moving Average

In [ ]:
with tmp as
(select visited_on, sum(amount) as day_sum
from customer
group by visited_on)

select a.visited_on, sum(b.day_sum) as amount, round(sum(b.day_sum)/7,2) as average_amount
from tmp a, tmp b
where datediff(a.visited_on, b.visited_on) in (0,1,2,3,4,5,6)
group by a.visited_on
having count(b.visited_on) = 7
order by a.visited_on